Autodesk.Revit.DB.ATFTranslationServiceData.CheckOptionsMatchExtension(System.String,Autodesk.Revit.DB.ATFBaseExportOptions)
Checks whether the options match the output file extension.
Returns:
Returns true if options match extension, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ATFTranslationServiceData.ExportOptions
Export options used for translation to STL, XML or SAT file formats.
Since:
2021

Autodesk.Revit.DB.ATFTranslationServiceData.FullOutputPath
Gets the output path where the translated document should be saved.
Since:
2021

Autodesk.Revit.DB.ATFTranslationServiceData.DocumentToTranslate
Gets the document which will be translated.
Since:
2021

Autodesk.Revit.DB.ATFTranslationServiceData.#ctor(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ATFBaseExportOptions)
Creates ATFTranslationServiceData object
documentToTranslate:
Represents a document to be translated via ATF framework.
fullOutputPath:
Full output path including file name and extension.
If extension is ".atfx" the document will be translated to xml format.
If extension is ".sat" the document will be translated to sat format.
If extension is ".stl" the document will be translated to stl format.
atfExportOptions:
Represents the export options used for translation to STL, XML or SAT file formats.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Provided export options don't match the provided file extension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ATFTranslationServiceData
This is a container for data which is passed from Revit to an instance of
IATFTranslationServer.
Since:
2021